STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_bus.c
/**
  ******************************************************************************
  * @file    stm32mp13xx_disco_bus.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage LEDs,
  *          push-buttons, external SDRAM, external QSPI Flash, RF EEPROM,
  *          available  board from STMicroelectronics.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_disco_bus.h"
#include "stm32mp13xx_disco_errno.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP13XX_DISCO
  * @{
  */

/** @defgroup STM32MP13XX_DISCO_BUS BUS
  * @{
  */

/** @defgroup Private_Marcos BUS Private Marcos
  * @{
  */
#define DIV_ROUND_CLOSEST(x, d)  (((x) + ((d) / 2U)) / (d))
/**
  * @}
  */
/** @defgroup Private_Constants BUS Private Constants
  * @{
  */
#define I2C_ANALOG_FILTER_ENABLE         1U
#define I2C_ANALOG_FILTER_DELAY_MIN      50U  /* ns */
#define I2C_ANALOG_FILTER_DELAY_MAX      260  /* ns */
#define I2C_ANALOG_FILTER_DELAY_DEFAULT  2U   /* ns */

#define VALID_PRESC_NBR  100U
#define PRESC_MAX        16U
#define SCLDEL_MAX       16U
#define SDADEL_MAX       16U
#define SCLH_MAX         256U
#define SCLL_MAX         256U
#define I2C_DNF_MAX      16U
#define NSEC_PER_SEC     1000000000UL
/**
  * @}
  */

/** @defgroup Exported_Variables BUS Exported Variables
  * @{
  */
static I2C_HandleTypeDef hbus_i2c5;
static I2C_HandleTypeDef hbus_i2c4;
static I2C_HandleTypeDef hbus_i2c1;
/**
  * @}
  */

/** @defgroup Private_Variables BUS Private Variables
  * @{
  */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
static uint32_t IsI2c5MspCbValid = 0U;
static uint32_t IsI2c4MspCbValid = 0U;
static uint32_t IsI2c1MspCbValid = 0U;
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */

/**
 * struct i2c_charac - private i2c specification timing
 */
struct i2c_specs
{
  uint32_t rate;        /* I2C bus speed (Hz)*/
  uint32_t rate_min;    /* 80% of I2C bus speed (Hz)*/
  uint32_t rate_max;    /* 100% of I2C bus speed (Hz)*/
  uint32_t fall_max;    /* Max fall time of both SDA and SCL signals (ns)*/
  uint32_t rise_max;    /* Max rise time of both SDA and SCL signals (ns)*/
  uint32_t hddat_min;   /* Min data hold time (ns)*/
  uint32_t vddat_max;   /* Max data valid time (ns)*/
  uint32_t sudat_min;   /* Min data setup time (ns)*/
  uint32_t l_min;       /* Min low period of the SCL clock (ns)*/
  uint32_t h_min;       /* Min high period of the SCL clock (ns)*/
};

enum i2c_speed
{
  I2C_SPEED_STANDARD  = 0U, /* 100 kHz */
  I2C_SPEED_FAST      = 1U, /* 400 kHz */
  I2C_SPEED_FAST_PLUS = 2U, /* 1 MHz */
};

/**
 * struct i2c_setup - private I2C timing setup parameters
 */
struct i2c_setup
{
  uint32_t rise_time;      /* Rise time (ns)*/
  uint32_t fall_time;      /* Fall time (ns)*/
  uint32_t dnf;            /* Digital filter coefficient (0-16)*/
  uint32_t analog_filter;  /* Analog filter delay (On/Off)*/
};


/**
 * struct i2c_timings - private I2C output parameters
 */
struct i2c_timings
{
  uint32_t presc;       /* Prescaler value*/
  uint32_t scldel;      /* Data setup time*/
  uint32_t sdadel;      /* Data hold time*/
  uint32_t sclh;        /* SCL high period (master mode)*/
  uint32_t scll;        /* SCL low period (master mode)*/
};

#if 0
/* Currently not used */
static const struct i2c_specs i2c_specs[] =
{
  [I2C_SPEED_STANDARD] =
  {
    .rate = 100000,
    .rate_min = 100000,
    .rate_max = 120000,
    .fall_max = 300,
    .rise_max = 1000,
    .hddat_min = 0,
    .vddat_max = 3450,
    .sudat_min = 250,
    .l_min = 4700,
    .h_min = 4000,
  },
  [I2C_SPEED_FAST] =
  {
    .rate = 400000,
    .rate_min = 320000,
    .rate_max = 400000,
    .fall_max = 300,
    .rise_max = 300,
    .hddat_min = 0,
    .vddat_max = 900,
    .sudat_min = 100,
    .l_min = 1300,
    .h_min = 600,
  },
  [I2C_SPEED_FAST_PLUS] =
  {
    .rate = 1000000,
    .rate_min = 800000,
    .rate_max = 1000000,
    .fall_max = 120,
    .rise_max = 120,
    .hddat_min = 0,
    .vddat_max = 450,
    .sudat_min = 50,
    .l_min = 500,
    .h_min = 260,
  },
};

static const struct i2c_setup i2c_user_setup[] =
{
  [I2C_SPEED_STANDARD] =
  {
    .rise_time = 400,
    .fall_time = 100,
    .dnf = I2C_ANALOG_FILTER_DELAY_DEFAULT,
    .analog_filter = 1,
  },
  [I2C_SPEED_FAST] =
  {
    .rise_time = 250,
    .fall_time = 100,
    .dnf = I2C_ANALOG_FILTER_DELAY_DEFAULT,
    .analog_filter = 1,
  },
  [I2C_SPEED_FAST_PLUS] =
  {
    .rise_time = 60,
    .fall_time = 100,
    .dnf = I2C_ANALOG_FILTER_DELAY_DEFAULT,
    .analog_filter = 1,
  },
};
#endif /* 0 */
/**
  * @}
  */

/** @defgroup Private_FunctionPrototypes BUS Private FunctionPrototypes
  * @{
  */

static void I2C5_MspInit(I2C_HandleTypeDef *hi2c);
static void I2C5_MspDeInit(I2C_HandleTypeDef *hi2c);
static int32_t I2C5_WriteReg(uint16_t DevAddr, uint16_t MemAddSize, uint16_t Reg, uint8_t *pData, uint16_t Length);
static int32_t I2C5_ReadReg(uint16_t DevAddr, uint16_t MemAddSize, uint16_t Reg, uint8_t *pData, uint16_t Length);

static void I2C4_MspInit(I2C_HandleTypeDef *hi2c);
static void I2C4_MspDeInit(I2C_HandleTypeDef *hi2c);
static int32_t I2C4_WriteReg(uint16_t DevAddr, uint16_t MemAddSize, uint16_t Reg, uint8_t *pData, uint16_t Length);
static int32_t I2C4_ReadReg(uint16_t DevAddr, uint16_t MemAddSize, uint16_t Reg, uint8_t *pData, uint16_t Length);

static void I2C1_MspInit(I2C_HandleTypeDef *hi2c);
static void I2C1_MspDeInit(I2C_HandleTypeDef *hi2c);
static int32_t I2C1_WriteReg(uint16_t DevAddr, uint16_t MemAddSize, uint16_t Reg, uint8_t *pData, uint16_t Length);
static int32_t I2C1_ReadReg(uint16_t DevAddr, uint16_t MemAddSize, uint16_t Reg, uint8_t *pData, uint16_t Length);

