STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_bus.c
  return BSP_ERROR_NONE;
}

/**
  * @brief  MX I2C4 initialization.
  * @param  phi2c I2C handle
  * @retval HAL status
  */
__weak HAL_StatusTypeDef MX_I2C4_Init(I2C_HandleTypeDef *phi2c)
{
  phi2c->Init.Timing           = BUS_I2Cx_TIMING;
  phi2c->Init.OwnAddress1      = 0x33U;   //STPMU1_I2C_ADDRESS
  phi2c->Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
  phi2c->Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
  phi2c->Init.OwnAddress2      = 0U;
  phi2c->Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  phi2c->Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
  phi2c->Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;

  return HAL_I2C_Init(phi2c);
}

/**
  * @brief  Write a 8bit value in a register of the device through BUS.
  * @param  DevAddr   Device address on Bus.
  * @param  Reg    The target register address to write
  * @param  pData  The target register value to be written
  * @param  Length buffer size to be written
  * @retval BSP status
  */
int32_t BSP_I2C4_WriteReg(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length)
{
  int32_t ret;

  if(I2C4_WriteReg(DevAddr, Reg, I2C_MEMADD_SIZE_8BIT, pData, Length) == (int32_t)HAL_OK)
  {
    ret = BSP_ERROR_NONE;
  }
  else
  {
    if( HAL_I2C_GetError(&hbus_i2c4) == HAL_I2C_ERROR_AF)
    {
      ret = BSP_ERROR_BUS_FAILURE;
    }
    else
    {
      ret =  BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
  * @brief  Read a 8bit register of the device through BUS
  * @param  DevAddr Device address on BUS
  * @param  Reg     The target register address to read
  * @param  pData   Pointer to data buffer
  * @param  Length  Length of the data
  * @retval BSP status
  */
int32_t BSP_I2C4_ReadReg(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length)
{
  int32_t ret;

  if(I2C4_ReadReg(DevAddr, Reg, I2C_MEMADD_SIZE_8BIT, pData, Length) == (int32_t)HAL_OK)
  {
    ret = BSP_ERROR_NONE;
  }
  else
  {
    if( HAL_I2C_GetError(&hbus_i2c4) == HAL_I2C_ERROR_AF)
    {
      ret = BSP_ERROR_BUS_FAILURE;
    }
    else
    {
      ret =  BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
  * @brief  Write a 16bit value in a register of the device through BUS.
  * @param  DevAddr   Device address on Bus.
  * @param  Reg    The target register address to write
  * @param  pData  The target register value to be written
  * @param  Length buffer size to be written
  * @retval BSP status
  */
int32_t BSP_I2C4_WriteReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length)
{
  int32_t ret;

  if(I2C4_WriteReg(DevAddr, Reg, I2C_MEMADD_SIZE_16BIT, pData, Length) == (int32_t)HAL_OK)
  {
    ret = BSP_ERROR_NONE;
  }
  else
  {
    if( HAL_I2C_GetError(&hbus_i2c4) == HAL_I2C_ERROR_AF)
    {
      ret = BSP_ERROR_BUS_FAILURE;
    }
    else
    {
      ret =  BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
  * @brief  Read a 16bit register of the device through BUS
  * @param  DevAddr Device address on BUS
  * @param  Reg     The target register address to read
  * @param  pData   Pointer to data buffer
  * @param  Length  Length of the data
  * @retval BSP status
  */
int32_t BSP_I2C4_ReadReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length)
{
  int32_t ret;

  if(I2C4_ReadReg(DevAddr, Reg, I2C_MEMADD_SIZE_16BIT, pData, Length) == (int32_t)HAL_OK)
  {
    ret = BSP_ERROR_NONE;
  }
  else
  {
    if( HAL_I2C_GetError(&hbus_i2c4) == HAL_I2C_ERROR_AF)
    {
      ret = BSP_ERROR_BUS_FAILURE;
    }
    else
    {
      ret =  BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
  * @brief  Checks if target device is ready for communication.
  * @note   This function is used with Memory devices
  * @param  DevAddr  Target device address
  * @param  Trials      Number of trials
  * @retval BSP status
  */
int32_t BSP_I2C4_IsReady(uint16_t DevAddr, uint32_t Trials)
{
  int32_t ret;

  if(HAL_I2C_IsDeviceReady(&hbus_i2c4, DevAddr, Trials, 1000) != HAL_OK)
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  return ret;
}

/**
 * @brief  Initialize BSP I2C1.
 * @retval BSP status.
 */
int32_t BSP_I2C1_Init(void)
{
 hbus_i2c1.Instance                  = BUS_I2C1_INSTANCE;

 if(HAL_I2C_GetState(&hbus_i2c1) == HAL_I2C_STATE_RESET)
 {
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 0)
   /* Init the I2C Msp */
   I2C1_MspInit(&hbus_i2c1);
#else
   if(IsI2c1MspCbValid == 0U)
   {
     if(BSP_I2C1_RegisterDefaultMspCallbacks() != BSP_ERROR_NONE)
     {
       return BSP_ERROR_MSP_FAILURE;
     }
   }
#endif

 if(MX_I2C1_Init(&hbus_i2c1) != HAL_OK)

   {
     return BSP_ERROR_BUS_FAILURE;
   }
 }
 return BSP_ERROR_NONE;
}

/**
 * @brief  DeInitializes BSP I2C1.
 * @retval BSP status.
 */
int32_t BSP_I2C1_DeInit(void)
{
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 0)
 I2C1_MspDeInit(&hbus_i2c1);
#endif /* (USE_HAL_I2C_REGISTER_CALLBACKS == 0) */

 /* Init the I2C */
 if (HAL_I2C_DeInit(&hbus_i2c1) != HAL_OK)
 {
   return BSP_ERROR_PERIPH_FAILURE;
 }

 return BSP_ERROR_NONE;
}

/**
 * @brief  MX I2C1 initialization.
 * @param  phi2c I2C handle
 * @retval HAL status
 */
__weak HAL_StatusTypeDef MX_I2C1_Init(I2C_HandleTypeDef *phi2c)
{
 phi2c->Init.Timing           = BUS_I2Cx_TIMING;
 phi2c->Init.OwnAddress1      = 0x33U;   //STPMU1_I2C_ADDRESS
 phi2c->Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
 phi2c->Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
 phi2c->Init.OwnAddress2      = 0U;
 phi2c->Init.OwnAddress2Masks = I2C_OA2_NOMASK;
 phi2c->Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
 phi2c->Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;

 return HAL_I2C_Init(phi2c);
}

/**
 * @brief  Write a 8bit value in a register of the device through BUS.
 * @param  DevAddr   Device address on Bus.
 * @param  Reg    The target register address to write
 * @param  pData  The target register value to be written
 * @param  Length buffer size to be written
 * @retval BSP status
 */
int32_t BSP_I2C1_WriteReg(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length)
{
 int32_t ret;

 if(I2C1_WriteReg(DevAddr, Reg, I2C_MEMADD_SIZE_8BIT, pData, Length) == (int32_t)HAL_OK)
 {
   ret = BSP_ERROR_NONE;
 }
 else
 {
   if( HAL_I2C_GetError(&hbus_i2c1) == HAL_I2C_ERROR_AF)
   {
     ret = BSP_ERROR_BUS_FAILURE;
   }
   else
   {
     ret =  BSP_ERROR_PERIPH_FAILURE;
   }
 }

 return ret;
}

/**
 * @brief  Read a 8bit register of the device through BUS
 * @param  DevAddr Device address on BUS
 * @param  Reg     The target register address to read
 * @param  pData   Pointer to data buffer
 * @param  Length  Length of the data
 * @retval BSP status
 */
int32_t BSP_I2C1_ReadReg(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length)
{
 int32_t ret;

